{
    "format": "layers-model",
    "generatedBy": "keras v2.13.1",
    "convertedBy": "TensorFlow.js Converter v4.10.0",
    "modelTopology": {
        "keras_version": "2.13.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_6",
                "layers": [{
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 240, 240, 3],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "vgg16_input"
                    }
                }, {
                    "class_name": "Functional",
                    "config": {
                        "name": "vgg16",
                        "trainable": true,
                        "layers": [{
                            "module": "keras.layers",
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [null, 240, 240, 3],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_8"
                            },
                            "registered_name": null,
                            "name": "input_8",
                            "inbound_nodes": []
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block1_conv1",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 240, 240, 3]
                            },
                            "name": "block1_conv1",
                            "inbound_nodes": [
                                [
                                    ["input_8", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block1_conv2",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 240, 240, 64]
                            },
                            "name": "block1_conv2",
                            "inbound_nodes": [
                                [
                                    ["block1_conv1", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block1_pool",
                                "trainable": false,
                                "dtype": "float32",
                                "pool_size": [2, 2],
                                "padding": "valid",
                                "strides": [2, 2],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 240, 240, 64]
                            },
                            "name": "block1_pool",
                            "inbound_nodes": [
                                [
                                    ["block1_conv2", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block2_conv1",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 120, 120, 64]
                            },
                            "name": "block2_conv1",
                            "inbound_nodes": [
                                [
                                    ["block1_pool", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block2_conv2",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 120, 120, 128]
                            },
                            "name": "block2_conv2",
                            "inbound_nodes": [
                                [
                                    ["block2_conv1", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block2_pool",
                                "trainable": false,
                                "dtype": "float32",
                                "pool_size": [2, 2],
                                "padding": "valid",
                                "strides": [2, 2],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 120, 120, 128]
                            },
                            "name": "block2_pool",
                            "inbound_nodes": [
                                [
                                    ["block2_conv2", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block3_conv1",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 60, 60, 128]
                            },
                            "name": "block3_conv1",
                            "inbound_nodes": [
                                [
                                    ["block2_pool", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block3_conv2",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 60, 60, 256]
                            },
                            "name": "block3_conv2",
                            "inbound_nodes": [
                                [
                                    ["block3_conv1", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block3_conv3",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 256,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 60, 60, 256]
                            },
                            "name": "block3_conv3",
                            "inbound_nodes": [
                                [
                                    ["block3_conv2", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block3_pool",
                                "trainable": false,
                                "dtype": "float32",
                                "pool_size": [2, 2],
                                "padding": "valid",
                                "strides": [2, 2],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 60, 60, 256]
                            },
                            "name": "block3_pool",
                            "inbound_nodes": [
                                [
                                    ["block3_conv3", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block4_conv1",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 30, 30, 256]
                            },
                            "name": "block4_conv1",
                            "inbound_nodes": [
                                [
                                    ["block3_pool", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block4_conv2",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 30, 30, 512]
                            },
                            "name": "block4_conv2",
                            "inbound_nodes": [
                                [
                                    ["block4_conv1", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block4_conv3",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 30, 30, 512]
                            },
                            "name": "block4_conv3",
                            "inbound_nodes": [
                                [
                                    ["block4_conv2", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block4_pool",
                                "trainable": false,
                                "dtype": "float32",
                                "pool_size": [2, 2],
                                "padding": "valid",
                                "strides": [2, 2],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 30, 30, 512]
                            },
                            "name": "block4_pool",
                            "inbound_nodes": [
                                [
                                    ["block4_conv3", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block5_conv1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 15, 15, 512]
                            },
                            "name": "block5_conv1",
                            "inbound_nodes": [
                                [
                                    ["block4_pool", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block5_conv2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 15, 15, 512]
                            },
                            "name": "block5_conv2",
                            "inbound_nodes": [
                                [
                                    ["block5_conv1", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "block5_conv3",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 512,
                                "kernel_size": [3, 3],
                                "strides": [1, 1],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [1, 1],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 15, 15, 512]
                            },
                            "name": "block5_conv3",
                            "inbound_nodes": [
                                [
                                    ["block5_conv2", 0, 0, {}]
                                ]
                            ]
                        }, {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "block5_pool",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [2, 2],
                                "padding": "valid",
                                "strides": [2, 2],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [null, 15, 15, 512]
                            },
                            "name": "block5_pool",
                            "inbound_nodes": [
                                [
                                    ["block5_conv3", 0, 0, {}]
                                ]
                            ]
                        }],
                        "input_layers": [
                            ["input_8", 0, 0]
                        ],
                        "output_layers": [
                            ["block5_pool", 0, 0]
                        ]
                    }
                }, {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_4",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_20",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1024,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [1],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_mean_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_variance_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_14",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_21",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 512,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_15",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.3,
                        "noise_shape": null,
                        "seed": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_22",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 6,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [{
                    "class_name": "MeanMetricWrapper",
                    "config": {
                        "name": "accuracy",
                        "dtype": "float32",
                        "fn": "categorical_accuracy"
                    }
                }]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 9.999999747378752e-05,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of40.bin", "group1-shard2of40.bin", "group1-shard3of40.bin", "group1-shard4of40.bin", "group1-shard5of40.bin", "group1-shard6of40.bin", "group1-shard7of40.bin", "group1-shard8of40.bin", "group1-shard9of40.bin", "group1-shard10of40.bin", "group1-shard11of40.bin", "group1-shard12of40.bin", "group1-shard13of40.bin", "group1-shard14of40.bin", "group1-shard15of40.bin", "group1-shard16of40.bin", "group1-shard17of40.bin", "group1-shard18of40.bin", "group1-shard19of40.bin", "group1-shard20of40.bin", "group1-shard21of40.bin", "group1-shard22of40.bin", "group1-shard23of40.bin", "group1-shard24of40.bin", "group1-shard25of40.bin", "group1-shard26of40.bin", "group1-shard27of40.bin", "group1-shard28of40.bin", "group1-shard29of40.bin", "group1-shard30of40.bin", "group1-shard31of40.bin", "group1-shard32of40.bin", "group1-shard33of40.bin", "group1-shard34of40.bin", "group1-shard35of40.bin", "group1-shard36of40.bin", "group1-shard37of40.bin", "group1-shard38of40.bin", "group1-shard39of40.bin", "group1-shard40of40.bin"],
        "weights": [{
            "name": "batch_normalization/gamma",
            "shape": [1024],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/beta",
            "shape": [1024],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/moving_mean",
            "shape": [1024],
            "dtype": "float32"
        }, {
            "name": "batch_normalization/moving_variance",
            "shape": [1024],
            "dtype": "float32"
        }, {
            "name": "dense_20/kernel",
            "shape": [25088, 1024],
            "dtype": "float32"
        }, {
            "name": "dense_20/bias",
            "shape": [1024],
            "dtype": "float32"
        }, {
            "name": "dense_21/kernel",
            "shape": [1024, 512],
            "dtype": "float32"
        }, {
            "name": "dense_21/bias",
            "shape": [512],
            "dtype": "float32"
        }, {
            "name": "dense_22/kernel",
            "shape": [512, 6],
            "dtype": "float32"
        }, {
            "name": "dense_22/bias",
            "shape": [6],
            "dtype": "float32"
        }, {
            "name": "block5_conv1/kernel",
            "shape": [3, 3, 512, 512],
            "dtype": "float32"
        }, {
            "name": "block5_conv1/bias",
            "shape": [512],
            "dtype": "float32"
        }, {
            "name": "block5_conv2/kernel",
            "shape": [3, 3, 512, 512],
            "dtype": "float32"
        }, {
            "name": "block5_conv2/bias",
            "shape": [512],
            "dtype": "float32"
        }, {
            "name": "block5_conv3/kernel",
            "shape": [3, 3, 512, 512],
            "dtype": "float32"
        }, {
            "name": "block5_conv3/bias",
            "shape": [512],
            "dtype": "float32"
        }, {
            "name": "block1_conv1/kernel",
            "shape": [3, 3, 3, 64],
            "dtype": "float32"
        }, {
            "name": "block1_conv1/bias",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "block1_conv2/kernel",
            "shape": [3, 3, 64, 64],
            "dtype": "float32"
        }, {
            "name": "block1_conv2/bias",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "block2_conv1/kernel",
            "shape": [3, 3, 64, 128],
            "dtype": "float32"
        }, {
            "name": "block2_conv1/bias",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "block2_conv2/kernel",
            "shape": [3, 3, 128, 128],
            "dtype": "float32"
        }, {
            "name": "block2_conv2/bias",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "block3_conv1/kernel",
            "shape": [3, 3, 128, 256],
            "dtype": "float32"
        }, {
            "name": "block3_conv1/bias",
            "shape": [256],
            "dtype": "float32"
        }, {
            "name": "block3_conv2/kernel",
            "shape": [3, 3, 256, 256],
            "dtype": "float32"
        }, {
            "name": "block3_conv2/bias",
            "shape": [256],
            "dtype": "float32"
        }, {
            "name": "block3_conv3/kernel",
            "shape": [3, 3, 256, 256],
            "dtype": "float32"
        }, {
            "name": "block3_conv3/bias",
            "shape": [256],
            "dtype": "float32"
        }, {
            "name": "block4_conv1/kernel",
            "shape": [3, 3, 256, 512],
            "dtype": "float32"
        }, {
            "name": "block4_conv1/bias",
